     H
     FCALCD     CF   E             WorkStn
      *
      /Free
          Number = 10;
          Text = 'Hi';
          Exfmt Rec01;
          *inlr = *on;
      /End-Free
      *
